{"maserati":"Maserati Mistral 3500 GTi This car has a 2 door coupé body style styled by Frua with a front mounted engine driving through the rear wheels. Powering the Maserati Mistral 3500 GTi is a double overhead camshaft, 3.7 litre naturally aspirated 6 cylinder engine, with 2 valves per cylinder that produces power and torque figures of 245 bhp (248 PS/183 kW) at 5500 rpm and 343 N•m (253 lb•ft/35 kgm) at 4000 rpm respectively. A 5 speed manual gearbox delivers the power to the wheels. Maximum speed claimed is 232 km/h (144 mph)." , "mcLaren":"The Senna is a road car from McLaren, with rear wheel drive, a mid located engine and a 2 door coupé body style. Its engine is a turbocharged petrol, 4 litre, double overhead camshaft 90 degree V 8 cylinder with 4 valves per cylinder. This powerplant has an output of 789 bhp (800 PS/588 kW) of power at 7250 rpm, and maximum torque of 800 N•m (590 lb•ft/81.6 kgm) at 5500-6700 rpm. A 7 speed automatic transmission supplies the power to the wheels. The McLaren Senna weighs a stated 1198 kg at the kerb. Top quoted speed is 340 km/h (211 mph)." , "nissan":"Nissan Sentra SR Turbo is a car that has a 4 door saloon (sedan) type body with a front mounted engine that delivers power to the front wheels. Its 4 cylinder, double overhead camshaft turbocharged powerplant has 4 valves per cylinder and a displacement of 1.6 litres. For this model it provides power and torque figures of 188 bhp (191 PS/140 kW) at 5600 rpm and 240 Nm (177 lbft/24.5 kgm) at 1600-5200 rpm respectively. A 6 speed manual gearbox transfers the power to the driven wheels. Quoted weight at the kerb is 1367 kg." , "audi":"The Audi A5 is a motor car from Audi, with all wheel drive, a front located engine and a 2 door coupé body style. Its 2 litre engine is a turbocharged, double overhead camshaft, 4 cylinder unit that develops 252 bhp (256 PS/188 kW) of power at 5000-6000 rpm, and maximum torque of 370 N•m (273 lb•ft/37.7 kgm) at 1600-4500 rpm. The engine transmits power to the wheels via a 6 speed manual gearbox. Its quoted kerb weight is 1610 kg. It is claimed to attain a maxiumum speed of 210 km/h (130 mph), officially quoted fuel consumption is 24/35/27 US MPG EPA city/highway/combined." , "bmw":"The BMW X4 M40d is a 5 door suv/sports utility vehicle-bodied car with a front mounted engine driving through all four wheels. The BMW X4 M40d is one of the G02 model family from BMW. The 6 cylinder, double overhead camshaft turbocharged powerplant has 4 valves per cylinder and a displacement of 3 litres. For this model it musters power and torque figures of 322 bhp (326 PS/240 kW) at 4400 rpm and 680 Nm (502 lbft/69.3 kgm) at 1750-2750 rpm respectively. An 8 speed automatic gearbox delivers the power to the wheels. The BMW X4 M40d weighs a stated 1970 kg at the kerb. Its maximum speed claimed is 250 km/h (155 mph), officially quoted fuel consumption is 7.2/5.9/6.4 l/100km urban/extra-urban/combined, and carbon dioxide emissions are 170.0 g/km." ,"dodge":"The Dodge Charger Daytona 392 is a saloon with 4 doors and a front mounted powerplant which supplies the power to the rear wheels. The 6.4 litre engine is a naturally aspirated, overhead valve, 8 cylinder unit that produces 485 bhp (492 PS/362 kW) of power at 6100 rpm, and maximum torque of 644 N•m (475 lb•ft/65.7 kgm) at 4100 rpm. An 8 speed automatic transmission transfers the power to the driven wheels. Its claimed kerb weight is 1991 kg." ,"lexus":"This vehicle has a 2 door coupé body style with a front mounted engine supplying power to the rear wheels. Its engine is a naturally aspirated petrol, 5 litre, double overhead camshaft 90 degree V 8 cylinder with 4 valves per cylinder. This powerplant develops 467 bhp (473 PS/348 kW) of power at 7100 rpm, and maximum torque of 528 N•m (389 lb•ft/53.8 kgm) at 4800-5600 rpm. The engine powers the wheels through an 8 speed automatic gearbox. It weighs a claimed 1795 kg at the kerb. Top stated speed is 270 km/h (168 mph), official fuel consumption figures are 16/25/19 US MPG EPA city/highway/combined." }